<script setup lang="ts">
import { EpTextFold } from 'e-plus-ui'
</script>

<template>
<EpTextFold>即在评论的数据结构中，包含一级评论、二级评论，总共两个层级.
  如果有回复二级评论的话， 这条评论也称为二级评论，只不过在这一条评论数据中，也要包含被回复的二级评论的数据（字段，reply）
  即在评论的数据结构中，包含一级评论、二级评论，总共两个层级. 如果有回复二级评论的话， 这条评论也称为二级评论，只不过在这一条评论数据中，也要包含被回复的二级评论的数据（字段，reply）
  即在评论的数据结构中，包含一级评论、二级评论，总共两个层级. 如果有回复二级评论的话， 这条评论也称为二级评论，只不过在这一条评论数据中，也要包含被回复的二级评论的数据（字段，reply）
  即在评论的数据结构中，包含一级评论、二级评论，总共两个层级. 如果有回复二级评论的话， 这条评论也称为二级评论，只不过在这一条评论数据中，也要包含被回复的二级评论的数据（字段，reply）
</EpTextFold>
</template>

<style scoped lang="scss">

</style>
